###################################################################

# Created by write_sdc on Sat Jun 8 00:33:44 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_load -pin_load 1 [get_ports block_done]
set_load -pin_load 1 [get_ports block_busy_n]
set_load -pin_load 1 [get_ports {cipher_text[15]}]
set_load -pin_load 1 [get_ports {cipher_text[14]}]
set_load -pin_load 1 [get_ports {cipher_text[13]}]
set_load -pin_load 1 [get_ports {cipher_text[12]}]
set_load -pin_load 1 [get_ports {cipher_text[11]}]
set_load -pin_load 1 [get_ports {cipher_text[10]}]
set_load -pin_load 1 [get_ports {cipher_text[9]}]
set_load -pin_load 1 [get_ports {cipher_text[8]}]
set_load -pin_load 1 [get_ports {cipher_text[7]}]
set_load -pin_load 1 [get_ports {cipher_text[6]}]
set_load -pin_load 1 [get_ports {cipher_text[5]}]
set_load -pin_load 1 [get_ports {cipher_text[4]}]
set_load -pin_load 1 [get_ports {cipher_text[3]}]
set_load -pin_load 1 [get_ports {cipher_text[2]}]
set_load -pin_load 1 [get_ports {cipher_text[1]}]
set_load -pin_load 1 [get_ports {cipher_text[0]}]
create_clock [get_ports clk]  -period 5  -waveform {0 2.5}
group_path -name FEEDTHROUGH  -from [list [get_ports rst_n] [get_ports block_start] [get_ports encrypt] [get_ports {plain_text[15]}] [get_ports {plain_text[14]}] [get_ports {plain_text[13]}] [get_ports {plain_text[12]}] [get_ports {plain_text[11]}] [get_ports {plain_text[10]}] [get_ports {plain_text[9]}] [get_ports {plain_text[8]}] [get_ports {plain_text[7]}] [get_ports {plain_text[6]}] [get_ports {plain_text[5]}] [get_ports {plain_text[4]}] [get_ports {plain_text[3]}] [get_ports {plain_text[2]}] [get_ports {plain_text[1]}] [get_ports {plain_text[0]}] [get_ports {chip_id[15]}] [get_ports {chip_id[14]}] [get_ports {chip_id[13]}] [get_ports {chip_id[12]}] [get_ports {chip_id[11]}] [get_ports {chip_id[10]}] [get_ports {chip_id[9]}] [get_ports {chip_id[8]}] [get_ports {chip_id[7]}] [get_ports {chip_id[6]}] [get_ports {chip_id[5]}] [get_ports {chip_id[4]}] [get_ports {chip_id[3]}] [get_ports {chip_id[2]}] [get_ports {chip_id[1]}] [get_ports {chip_id[0]}]]  -to [list [get_ports block_done] [get_ports block_busy_n] [get_ports {cipher_text[15]}] [get_ports {cipher_text[14]}] [get_ports {cipher_text[13]}] [get_ports {cipher_text[12]}] [get_ports {cipher_text[11]}] [get_ports {cipher_text[10]}] [get_ports {cipher_text[9]}] [get_ports {cipher_text[8]}] [get_ports {cipher_text[7]}] [get_ports {cipher_text[6]}] [get_ports {cipher_text[5]}] [get_ports {cipher_text[4]}] [get_ports {cipher_text[3]}] [get_ports {cipher_text[2]}] [get_ports {cipher_text[1]}] [get_ports {cipher_text[0]}]]
group_path -name REGIN  -from [list [get_ports rst_n] [get_ports block_start] [get_ports encrypt] [get_ports {plain_text[15]}] [get_ports {plain_text[14]}] [get_ports {plain_text[13]}] [get_ports {plain_text[12]}] [get_ports {plain_text[11]}] [get_ports {plain_text[10]}] [get_ports {plain_text[9]}] [get_ports {plain_text[8]}] [get_ports {plain_text[7]}] [get_ports {plain_text[6]}] [get_ports {plain_text[5]}] [get_ports {plain_text[4]}] [get_ports {plain_text[3]}] [get_ports {plain_text[2]}] [get_ports {plain_text[1]}] [get_ports {plain_text[0]}] [get_ports {chip_id[15]}] [get_ports {chip_id[14]}] [get_ports {chip_id[13]}] [get_ports {chip_id[12]}] [get_ports {chip_id[11]}] [get_ports {chip_id[10]}] [get_ports {chip_id[9]}] [get_ports {chip_id[8]}] [get_ports {chip_id[7]}] [get_ports {chip_id[6]}] [get_ports {chip_id[5]}] [get_ports {chip_id[4]}] [get_ports {chip_id[3]}] [get_ports {chip_id[2]}] [get_ports {chip_id[1]}] [get_ports {chip_id[0]}]]
group_path -name REGOUT  -to [list [get_ports block_done] [get_ports block_busy_n] [get_ports {cipher_text[15]}] [get_ports {cipher_text[14]}] [get_ports {cipher_text[13]}] [get_ports {cipher_text[12]}] [get_ports {cipher_text[11]}] [get_ports {cipher_text[10]}] [get_ports {cipher_text[9]}] [get_ports {cipher_text[8]}] [get_ports {cipher_text[7]}] [get_ports {cipher_text[6]}] [get_ports {cipher_text[5]}] [get_ports {cipher_text[4]}] [get_ports {cipher_text[3]}] [get_ports {cipher_text[2]}] [get_ports {cipher_text[1]}] [get_ports {cipher_text[0]}]]
set_input_delay -clock clk  -max 0.5  [get_ports rst_n]
set_input_delay -clock clk  -min 0.3  [get_ports rst_n]
set_input_delay -clock clk  -max 0.5  [get_ports block_start]
set_input_delay -clock clk  -min 0.3  [get_ports block_start]
set_input_delay -clock clk  -max 0.5  [get_ports encrypt]
set_input_delay -clock clk  -min 0.3  [get_ports encrypt]
set_input_delay -clock clk  -max 0.5  [get_ports {plain_text[15]}]
set_input_delay -clock clk  -min 0.3  [get_ports {plain_text[15]}]
set_input_delay -clock clk  -max 0.5  [get_ports {plain_text[14]}]
set_input_delay -clock clk  -min 0.3  [get_ports {plain_text[14]}]
set_input_delay -clock clk  -max 0.5  [get_ports {plain_text[13]}]
set_input_delay -clock clk  -min 0.3  [get_ports {plain_text[13]}]
set_input_delay -clock clk  -max 0.5  [get_ports {plain_text[12]}]
set_input_delay -clock clk  -min 0.3  [get_ports {plain_text[12]}]
set_input_delay -clock clk  -max 0.5  [get_ports {plain_text[11]}]
set_input_delay -clock clk  -min 0.3  [get_ports {plain_text[11]}]
set_input_delay -clock clk  -max 0.5  [get_ports {plain_text[10]}]
set_input_delay -clock clk  -min 0.3  [get_ports {plain_text[10]}]
set_input_delay -clock clk  -max 0.5  [get_ports {plain_text[9]}]
set_input_delay -clock clk  -min 0.3  [get_ports {plain_text[9]}]
set_input_delay -clock clk  -max 0.5  [get_ports {plain_text[8]}]
set_input_delay -clock clk  -min 0.3  [get_ports {plain_text[8]}]
set_input_delay -clock clk  -max 0.5  [get_ports {plain_text[7]}]
set_input_delay -clock clk  -min 0.3  [get_ports {plain_text[7]}]
set_input_delay -clock clk  -max 0.5  [get_ports {plain_text[6]}]
set_input_delay -clock clk  -min 0.3  [get_ports {plain_text[6]}]
set_input_delay -clock clk  -max 0.5  [get_ports {plain_text[5]}]
set_input_delay -clock clk  -min 0.3  [get_ports {plain_text[5]}]
set_input_delay -clock clk  -max 0.5  [get_ports {plain_text[4]}]
set_input_delay -clock clk  -min 0.3  [get_ports {plain_text[4]}]
set_input_delay -clock clk  -max 0.5  [get_ports {plain_text[3]}]
set_input_delay -clock clk  -min 0.3  [get_ports {plain_text[3]}]
set_input_delay -clock clk  -max 0.5  [get_ports {plain_text[2]}]
set_input_delay -clock clk  -min 0.3  [get_ports {plain_text[2]}]
set_input_delay -clock clk  -max 0.5  [get_ports {plain_text[1]}]
set_input_delay -clock clk  -min 0.3  [get_ports {plain_text[1]}]
set_input_delay -clock clk  -max 0.5  [get_ports {plain_text[0]}]
set_input_delay -clock clk  -min 0.3  [get_ports {plain_text[0]}]
set_input_delay -clock clk  -max 0.5  [get_ports {chip_id[15]}]
set_input_delay -clock clk  -min 0.3  [get_ports {chip_id[15]}]
set_input_delay -clock clk  -max 0.5  [get_ports {chip_id[14]}]
set_input_delay -clock clk  -min 0.3  [get_ports {chip_id[14]}]
set_input_delay -clock clk  -max 0.5  [get_ports {chip_id[13]}]
set_input_delay -clock clk  -min 0.3  [get_ports {chip_id[13]}]
set_input_delay -clock clk  -max 0.5  [get_ports {chip_id[12]}]
set_input_delay -clock clk  -min 0.3  [get_ports {chip_id[12]}]
set_input_delay -clock clk  -max 0.5  [get_ports {chip_id[11]}]
set_input_delay -clock clk  -min 0.3  [get_ports {chip_id[11]}]
set_input_delay -clock clk  -max 0.5  [get_ports {chip_id[10]}]
set_input_delay -clock clk  -min 0.3  [get_ports {chip_id[10]}]
set_input_delay -clock clk  -max 0.5  [get_ports {chip_id[9]}]
set_input_delay -clock clk  -min 0.3  [get_ports {chip_id[9]}]
set_input_delay -clock clk  -max 0.5  [get_ports {chip_id[8]}]
set_input_delay -clock clk  -min 0.3  [get_ports {chip_id[8]}]
set_input_delay -clock clk  -max 0.5  [get_ports {chip_id[7]}]
set_input_delay -clock clk  -min 0.3  [get_ports {chip_id[7]}]
set_input_delay -clock clk  -max 0.5  [get_ports {chip_id[6]}]
set_input_delay -clock clk  -min 0.3  [get_ports {chip_id[6]}]
set_input_delay -clock clk  -max 0.5  [get_ports {chip_id[5]}]
set_input_delay -clock clk  -min 0.3  [get_ports {chip_id[5]}]
set_input_delay -clock clk  -max 0.5  [get_ports {chip_id[4]}]
set_input_delay -clock clk  -min 0.3  [get_ports {chip_id[4]}]
set_input_delay -clock clk  -max 0.5  [get_ports {chip_id[3]}]
set_input_delay -clock clk  -min 0.3  [get_ports {chip_id[3]}]
set_input_delay -clock clk  -max 0.5  [get_ports {chip_id[2]}]
set_input_delay -clock clk  -min 0.3  [get_ports {chip_id[2]}]
set_input_delay -clock clk  -max 0.5  [get_ports {chip_id[1]}]
set_input_delay -clock clk  -min 0.3  [get_ports {chip_id[1]}]
set_input_delay -clock clk  -max 0.5  [get_ports {chip_id[0]}]
set_input_delay -clock clk  -min 0.3  [get_ports {chip_id[0]}]
set_output_delay -clock clk  -max 0.5  [get_ports block_done]
set_output_delay -clock clk  -min 0.3  [get_ports block_done]
set_output_delay -clock clk  -max 0.5  [get_ports block_busy_n]
set_output_delay -clock clk  -min 0.3  [get_ports block_busy_n]
set_output_delay -clock clk  -max 0.5  [get_ports {cipher_text[15]}]
set_output_delay -clock clk  -min 0.3  [get_ports {cipher_text[15]}]
set_output_delay -clock clk  -max 0.5  [get_ports {cipher_text[14]}]
set_output_delay -clock clk  -min 0.3  [get_ports {cipher_text[14]}]
set_output_delay -clock clk  -max 0.5  [get_ports {cipher_text[13]}]
set_output_delay -clock clk  -min 0.3  [get_ports {cipher_text[13]}]
set_output_delay -clock clk  -max 0.5  [get_ports {cipher_text[12]}]
set_output_delay -clock clk  -min 0.3  [get_ports {cipher_text[12]}]
set_output_delay -clock clk  -max 0.5  [get_ports {cipher_text[11]}]
set_output_delay -clock clk  -min 0.3  [get_ports {cipher_text[11]}]
set_output_delay -clock clk  -max 0.5  [get_ports {cipher_text[10]}]
set_output_delay -clock clk  -min 0.3  [get_ports {cipher_text[10]}]
set_output_delay -clock clk  -max 0.5  [get_ports {cipher_text[9]}]
set_output_delay -clock clk  -min 0.3  [get_ports {cipher_text[9]}]
set_output_delay -clock clk  -max 0.5  [get_ports {cipher_text[8]}]
set_output_delay -clock clk  -min 0.3  [get_ports {cipher_text[8]}]
set_output_delay -clock clk  -max 0.5  [get_ports {cipher_text[7]}]
set_output_delay -clock clk  -min 0.3  [get_ports {cipher_text[7]}]
set_output_delay -clock clk  -max 0.5  [get_ports {cipher_text[6]}]
set_output_delay -clock clk  -min 0.3  [get_ports {cipher_text[6]}]
set_output_delay -clock clk  -max 0.5  [get_ports {cipher_text[5]}]
set_output_delay -clock clk  -min 0.3  [get_ports {cipher_text[5]}]
set_output_delay -clock clk  -max 0.5  [get_ports {cipher_text[4]}]
set_output_delay -clock clk  -min 0.3  [get_ports {cipher_text[4]}]
set_output_delay -clock clk  -max 0.5  [get_ports {cipher_text[3]}]
set_output_delay -clock clk  -min 0.3  [get_ports {cipher_text[3]}]
set_output_delay -clock clk  -max 0.5  [get_ports {cipher_text[2]}]
set_output_delay -clock clk  -min 0.3  [get_ports {cipher_text[2]}]
set_output_delay -clock clk  -max 0.5  [get_ports {cipher_text[1]}]
set_output_delay -clock clk  -min 0.3  [get_ports {cipher_text[1]}]
set_output_delay -clock clk  -max 0.5  [get_ports {cipher_text[0]}]
set_output_delay -clock clk  -min 0.3  [get_ports {cipher_text[0]}]
set_input_transition -max 0.1  [get_ports rst_n]
set_input_transition -min 0.1  [get_ports rst_n]
set_input_transition -max 0.1  [get_ports block_start]
set_input_transition -min 0.1  [get_ports block_start]
set_input_transition -max 0.1  [get_ports encrypt]
set_input_transition -min 0.1  [get_ports encrypt]
set_input_transition -max 0.1  [get_ports {plain_text[15]}]
set_input_transition -min 0.1  [get_ports {plain_text[15]}]
set_input_transition -max 0.1  [get_ports {plain_text[14]}]
set_input_transition -min 0.1  [get_ports {plain_text[14]}]
set_input_transition -max 0.1  [get_ports {plain_text[13]}]
set_input_transition -min 0.1  [get_ports {plain_text[13]}]
set_input_transition -max 0.1  [get_ports {plain_text[12]}]
set_input_transition -min 0.1  [get_ports {plain_text[12]}]
set_input_transition -max 0.1  [get_ports {plain_text[11]}]
set_input_transition -min 0.1  [get_ports {plain_text[11]}]
set_input_transition -max 0.1  [get_ports {plain_text[10]}]
set_input_transition -min 0.1  [get_ports {plain_text[10]}]
set_input_transition -max 0.1  [get_ports {plain_text[9]}]
set_input_transition -min 0.1  [get_ports {plain_text[9]}]
set_input_transition -max 0.1  [get_ports {plain_text[8]}]
set_input_transition -min 0.1  [get_ports {plain_text[8]}]
set_input_transition -max 0.1  [get_ports {plain_text[7]}]
set_input_transition -min 0.1  [get_ports {plain_text[7]}]
set_input_transition -max 0.1  [get_ports {plain_text[6]}]
set_input_transition -min 0.1  [get_ports {plain_text[6]}]
set_input_transition -max 0.1  [get_ports {plain_text[5]}]
set_input_transition -min 0.1  [get_ports {plain_text[5]}]
set_input_transition -max 0.1  [get_ports {plain_text[4]}]
set_input_transition -min 0.1  [get_ports {plain_text[4]}]
set_input_transition -max 0.1  [get_ports {plain_text[3]}]
set_input_transition -min 0.1  [get_ports {plain_text[3]}]
set_input_transition -max 0.1  [get_ports {plain_text[2]}]
set_input_transition -min 0.1  [get_ports {plain_text[2]}]
set_input_transition -max 0.1  [get_ports {plain_text[1]}]
set_input_transition -min 0.1  [get_ports {plain_text[1]}]
set_input_transition -max 0.1  [get_ports {plain_text[0]}]
set_input_transition -min 0.1  [get_ports {plain_text[0]}]
set_input_transition -max 0.1  [get_ports {chip_id[15]}]
set_input_transition -min 0.1  [get_ports {chip_id[15]}]
set_input_transition -max 0.1  [get_ports {chip_id[14]}]
set_input_transition -min 0.1  [get_ports {chip_id[14]}]
set_input_transition -max 0.1  [get_ports {chip_id[13]}]
set_input_transition -min 0.1  [get_ports {chip_id[13]}]
set_input_transition -max 0.1  [get_ports {chip_id[12]}]
set_input_transition -min 0.1  [get_ports {chip_id[12]}]
set_input_transition -max 0.1  [get_ports {chip_id[11]}]
set_input_transition -min 0.1  [get_ports {chip_id[11]}]
set_input_transition -max 0.1  [get_ports {chip_id[10]}]
set_input_transition -min 0.1  [get_ports {chip_id[10]}]
set_input_transition -max 0.1  [get_ports {chip_id[9]}]
set_input_transition -min 0.1  [get_ports {chip_id[9]}]
set_input_transition -max 0.1  [get_ports {chip_id[8]}]
set_input_transition -min 0.1  [get_ports {chip_id[8]}]
set_input_transition -max 0.1  [get_ports {chip_id[7]}]
set_input_transition -min 0.1  [get_ports {chip_id[7]}]
set_input_transition -max 0.1  [get_ports {chip_id[6]}]
set_input_transition -min 0.1  [get_ports {chip_id[6]}]
set_input_transition -max 0.1  [get_ports {chip_id[5]}]
set_input_transition -min 0.1  [get_ports {chip_id[5]}]
set_input_transition -max 0.1  [get_ports {chip_id[4]}]
set_input_transition -min 0.1  [get_ports {chip_id[4]}]
set_input_transition -max 0.1  [get_ports {chip_id[3]}]
set_input_transition -min 0.1  [get_ports {chip_id[3]}]
set_input_transition -max 0.1  [get_ports {chip_id[2]}]
set_input_transition -min 0.1  [get_ports {chip_id[2]}]
set_input_transition -max 0.1  [get_ports {chip_id[1]}]
set_input_transition -min 0.1  [get_ports {chip_id[1]}]
set_input_transition -max 0.1  [get_ports {chip_id[0]}]
set_input_transition -min 0.1  [get_ports {chip_id[0]}]
